/*Задача о замыканиях: напишите функцию, 
которая будет принимать массив функций и возвращать новую функцию, 
которая вызывает каждую функцию в этом массиве и возвращает массив результатов, 
полученных после вызова каждой функции.

В этом примере executeFunctionsAndGetResults принимает массив функций и возвращает новую функцию. 
Когда эта новая функция вызывается, она итерирует по переданному массиву функций, 
вызывает каждую из них и добавляет результаты в массив. После завершения вызова всех функций, массив результатов возвращается.
*/
